# ========= до функцій =========
# 1. задано число n натуральне, перевірити, чи є воно простим
# цикл, ділімо на всі числа від 2 до n-1

# 2. задано число m натуральне, перевірити чи воно є простим
# копіюємо код з задачі 1 + міняємо n на m

# ========== функції ============
# 1. задано число n натуральне, перевірити, чи є воно простим
# 2. задано число m натуральне, перевірити чи воно є простим

# оформляємо перевірку на простоту у вигляді функції (у цьому ж файлі з програмою)
# та викликаємо цю функцію для n та m

# недолік! якщо цю перевірку на простоту треба робити в іншій програмі, то треба копіювати опис цієї функції у нашу програму
# def is_prime(n):
#     prime = True
#     for i in range(2, int(n**0.5) + 1):
#         if n % i == 0:
#             prime = False
#             break
#
#     return prime  # повернення результату у місце її виклику

# Питання!? чи можна описати функцію один раз в якомусь файлі
# і використовувати її у подальшому без копіювання її у нашу програму?
# Відповідь - модулі та пакети!!! Або іншими словами Бібліотеки
