
s = "Hello world!"  # s - рядок, тобто послідовність символів
#    012345678901 - рядок - послідовність, отже всі символи занумеровані починаючи з нуля

print(s[6])  # визначений оператор квадратні дужки для звертання до відповідного символу рядка за індексом

print(s[6: 11])  # визначена операція зрізу

# s[6] = "W"  # зміна символів рядка не допускається, РЯДОК = КОРТЕЖ СИМВОЛІВ

print(s)

for char in s:  # рядок - колекція, отже рядок можна пробігати по-елементно використовуючи цикл for
    print(char)

print(len(s)) # раз колекція, значить є функція len для визначення довжини рядка, тобто кількості елементів

# s1 = "Hello"
# s2 = "world"
# print(s1 + s2)


