lst = [1, 0, 3]

while True:
    try:
        a = lst.pop()  # тут може виникнути виключення IndexError
        print(1 / a)   # тут потенційно може виникнути ділення на нуль ZeroDivisionError
    except IndexError:
        break
    except ZeroDivisionError:
        print("ай-яй-яй, хто ж тебе на мехматі вчив ділити на нуль")
    else:  # виконується, якщо виключної ситуації не відбулося
        print("на цьому кроці виключення не відбулося")
    finally: # виконується у будь-якому разі, не залежно чи відбулася виключна ситуація, чи ні
        print("виконається у будь-якому разі")

pass