# Два простих числа називаються "близнюками",
# якщо вони відрізняються одне від одного на 2 (наприклад, числа 41 та 43).
# Скласти програму виведення на друк усіх пар "близнюків"
# із відрізка [n,2n], де n – задане ціле число, яке більше за 2.


def prime(k):
    for i in range(2, k):
        if k % i == 0:
            return False

    return True


############# MAIN PROGRAM ##############
n = int(input())

for i in range(n, 2 * n - 1):
    if prime(i) and prime(i + 2):
        print(i, i+2)
