# Визначити чи є введене з клавіатури натуральне число N простим

# число N просте, якщо воно ділиться на себе та на 1
# отже, якщо ми поділимо наше число N на всі числа від 2 до N-1
# та для всіх отримаємо остачу відмінну від 0, то число просте
# 5: 2, 3, 4 - отже 5 просте
# 9: 2, 3, 4, 5, 6, 7, 8, - отже 9 - не просте

N = int(input("N=? "))

isPrime = True  # змінна isPrime буде містити True, якщо число N просте та False, якщо число не є простим
i = 2
while i <= N-1:
    # print(i)
    if N % i == 0: # N - націло поділилося на i, отже число не є простим
        # print("число не є простим")
        isPrime = False

    i = i + 1 # i += i

if isPrime:
    print("число просте")
else:
    print("число не є простим")