# Описати рекурсивну функцію перевірки рядка на симетричність

#   s
# abcba  - симетричний
# abcсa  - не симетричний

# is_sym(s) -> так чи ні

# s = "" або s складається з однієї літери, то він симетричний
# s довший за одну літеру:
#      тоді він симетричний, якщо перша літера збігається з останньою
#      та симетричним є рядок, що без першої та останньої літери

def is_sym(s):
    if len(s) <= 1: # s = "" або s складається з однієї літери - термінальний випадок
        return True
    else: # рядок s довший за одну літеру
        return s[0] == s[-1] and is_sym(s[1:-1])

# def is_sym(s):
#     if len(s) <= 1: # s = "" або s складається з однієї літери - термінальний випадок
#         return True
#     elif s[0] != s[-1]:
#         return False
#     else: # рядок s довший за одну літеру
#         return is_sym(s[1:-1])

s = "abcBA"
print(is_sym(s))